In [20]:
#MongoClient Import
from pymongo import MongoClient

In [21]:
#database connection
url="mongodb://localhost:27017/"
client=MongoClient(url)
db=client['Organizer']

In [22]:
#creating collections
collection=db.student
collection=db.city
collection=db.country
collection=db.courses

In [23]:
#Adding data to the student collection
db.student.insert_one({"first_name":"Faith","last_Name":"Wanja","email":"faith_wanja@gmail.com","cell_phone":"0946598432","physical_addr":"Wall Street","gender":"Female", "city_id":"2", "country_id":"2", "course_id":"1", "student_id":"1"})
db.student.insert_one({"first_name":"Mark","last_Name":"Korir","email":"mark_korir@gmail.com","cell_phone":"0932984746","physical_addr":"Embakasi","gender":"Male", "city_id":"1", "country_id":"1", "course_id":"4", "student_id":"2"})
db.student.insert_one({"first_name":"Pauline","last_Name":"Wairimu","email":"pauline_wairimu@gmail.com","cell_phone":"0826316540","physical_addr":"Melrose Arch","gender":"Female", "city_id":"4", "country_id":"4", "course_id":"3", "student_id":"3"})
db.student.insert_one({"first_name":"Ann","last_Name":"Wachuka","email":"ann_wachuka@gmail.com","cell_phone":"0865797943","physical_addr":"Riley Park","gender":"Female", "city_id":"3", "country_id":"3", "course_id":"1", "student_id":"4"})
db.student.insert_one({"first_name":"Jack","last_Name":"Kariuki","email":"jack_kariuki@gmail.com","cell_phone":"0647693715","physical_addr":"Westlands","gender":"Male", "city_id":"1", "country_id":"1", "course_id":"2", "student_id":"5"})
print("Data added successfully")

Data added successfully

In [24]:
#Adding data to the city collection
cities={"city_id":"1", 'city_name':'Nairobi'}, {"city_id":"2",'city_name':'New York'}, {"city_id":"3",'city_name':'Vancouver'}, {"city_id":"4",'city_name':'Johannesburg'}
db.city.insert_many(cities)
print("Data added successfully")

Data added successfully

In [25]:
#Adding data to the collection Country
countries={"country_id":"1", 'country_name':'Kenya'}, {"country_id":"2", 'country_name':'USA'}, {"country_id":"3",'country_name':'Canada'},{"country_id":"4",'country_name':'South Africa'}
db.country.insert_many(countries)
print("Data added successfully")

Data added successfully

In [26]:
#Adding data to courses collection
courses={"course_id":"1", 'course_name':'Advanced Python'}, {"course_id":"2", 'course_name':'Machine Learning'}, {"course_id":"3", 'course_name':'Artificial Intelligence'}, {"course_id":"4", 'course_name':'Computer Science'}
db.courses.insert_many(courses)
print("Data added successfully")

Data added successfully

In [27]:
#Displaying the student collection
data=db.student.find()
for row in data:
    print (row)

{'_id': ObjectId('612925556dc5d1ed8a8eb222'), 'first_name': 'Faith', 'last_Name': 'Wanja', 'email': 'faith_wanja@gmail.com', 'cell_phone': '0946598432', 'physical_addr': 'Wall Street', 'gender': 'Female', 'city_id': '2', 'country_id': '2', 'course_id': '1', 'student_id': '1'}
{'_id': ObjectId('612925556dc5d1ed8a8eb223'), 'first_name': 'Mark', 'last_Name': 'Korir', 'email': 'mark_korir@gmail.com', 'cell_phone': '0932984746', 'physical_addr': 'Embakasi', 'gender': 'Male', 'city_id': '1', 'country_id': '1', 'course_id': '4', 'student_id': '2'}
{'_id': ObjectId('612925556dc5d1ed8a8eb224'), 'first_name': 'Pauline', 'last_Name': 'Wairimu', 'email': 'pauline_wairimu@gmail.com', 'cell_phone': '0826316540', 'physical_addr': 'Melrose Arch', 'gender': 'Female', 'city_id': '4', 'country_id': '4', 'course_id': '3', 'student_id': '3'}
{'_id': ObjectId('612925556dc5d1ed8a8eb225'), 'first_name': 'Ann', 'last_Name': 'Wachuka', 'email': 'ann_wachuka@gmail.com', 'cell_phone': '0865797943', 'physical_addr': 'Riley Park', 'gender': 'Female', 'city_id': '3', 'country_id': '3', 'course_id': '1', 'student_id': '4'}
{'_id': ObjectId('612925556dc5d1ed8a8eb226'), 'first_name': 'Jack', 'last_Name': 'Kariuki', 'email': 'jack_kariuki@gmail.com', 'cell_phone': '0647693715', 'physical_addr': 'Westlands', 'gender': 'Male', 'city_id': '1', 'country_id': '1', 'course_id': '2', 'student_id': '5'}

In [28]:
#Displaying the city collection
data=db.city.find()
for row in data:
    print(row)

{'_id': ObjectId('612925556dc5d1ed8a8eb227'), 'city_id': '1', 'city_name': 'Nairobi'}
{'_id': ObjectId('612925556dc5d1ed8a8eb228'), 'city_id': '2', 'city_name': 'New York'}
{'_id': ObjectId('612925556dc5d1ed8a8eb229'), 'city_id': '3', 'city_name': 'Vancouver'}
{'_id': ObjectId('612925556dc5d1ed8a8eb22a'), 'city_id': '4', 'city_name': 'Johannesburg'}

In [29]:
#Displaying the country collection
data=db.country.find()
for row in data:
    print(row)

{'_id': ObjectId('612925566dc5d1ed8a8eb22b'), 'country_id': '1', 'country_name': 'Kenya'}
{'_id': ObjectId('612925566dc5d1ed8a8eb22c'), 'country_id': '2', 'country_name': 'USA'}
{'_id': ObjectId('612925566dc5d1ed8a8eb22d'), 'country_id': '3', 'country_name': 'Canada'}
{'_id': ObjectId('612925566dc5d1ed8a8eb22e'), 'country_id': '4', 'country_name': 'South Africa'}

In [30]:
#Displaying courses collection
data=db.courses.find()
for row in data:
    print(row)

{'_id': ObjectId('612925566dc5d1ed8a8eb22f'), 'course_id': '1', 'course_name': 'Advanced Python'}
{'_id': ObjectId('612925566dc5d1ed8a8eb230'), 'course_id': '2', 'course_name': 'Machine Learning'}
{'_id': ObjectId('612925566dc5d1ed8a8eb231'), 'course_id': '3', 'course_name': 'Artificial Intelligence'}
{'_id': ObjectId('612925566dc5d1ed8a8eb232'), 'course_id': '4', 'course_name': 'Computer Science'}

In [31]:
#displaying data as dataframes using Pandas library
import pandas as pd

In [32]:
#creating the student dataframe
studentdf=pd.DataFrame ([x for x in db.student.find()])
#set index for the data in dataframe
studentdf.set_index('student_id', inplace=True)
#remove default_id by the MongoDB
studentdf.drop('_id', inplace = True, axis=1)
#display the student dataframe
studentdf

,first_name,last_Name,email,cell_phone,physical_addr,gender,city_id,country_id,course_id
student_id,,,,,,,,,
1,Faith,Wanja,faith_wanja@gmail.com,0946598432,Wall Street,Female,2,2,1
2,Mark,Korir,mark_korir@gmail.com,0932984746,Embakasi,Male,1,1,4
3,Pauline,Wairimu,pauline_wairimu@gmail.com,0826316540,Melrose Arch,Female,4,4,3
4,Ann,Wachuka,ann_wachuka@gmail.com,0865797943,Riley Park,Female,3,3,1
5,Jack,Kariuki,jack_kariuki@gmail.com,0647693715,Westlands,Male,1,1,2

In [33]:
#creating the city dataframe
citydf=pd.DataFrame ([x for x in db.city.find()])
#set index for the data in the dataframe
citydf.set_index("city_id", inplace = True)
#remove the default ID column by MongoDB
citydf.drop('_id', inplace = True, axis=1)
#Display data
citydf

            city_name
city_id
1             Nairobi
2            New York
3           Vancouver
4        Johannesburg

In [34]:
#creating the country dataframe
countrydf=pd.DataFrame ([x for x in db.country.find()])
#set index
countrydf.set_index("country_id", inplace= True)
#remove the default ID column by mongoDB
countrydf.drop('_id', inplace= True, axis=1)
#display the formatted data
countrydf

            country_name
country_id
1                  Kenya
2                    USA
3                 Canada
4           South Africa

In [35]:
#Format the data retieved from the Courses collection using pandas
coursesdf=pd.DataFrame ([x for x in db.courses.find()])
#set index for the data
coursesdf.set_index("course_id", inplace=True)
#remove the _id column from the presentation
coursesdf.drop("_id", inplace = True, axis=1)
#do data presentation
coursesdf

                       course_name
course_id
1                  Advanced Python
2                 Machine Learning
3          Artificial Intelligence
4                 Computer Science

In [36]:
#Join the collection to produce data in a single table
#use aggregate function and lookup
join_student_courses = db.student.aggregate(
[
    {
         "$lookup":{
            "from":"courses",
            "localField":"course_id",
            "foreignField":"course_id",
            "as":"student_courses"
        }
    },
    #select fields to display from the selction
{   "$unwind":"$student_courses" },
        {
        "$project":{
            "_id":0,
            "student_id":1,
            "first_name":1,
            "last_name":1,
            "gender":1,
            "course_name":"$student_courses.course_name"
            
        }
    }
]
)
    
#Data presentation in tabular form using pandas
studentcoursesdf = pd.DataFrame (list(join_student_courses))
#setting index
studentcoursesdf.set_index("student_id", inplace= True)
#displaying the joined table
studentcoursesdf
#for j in join_student_courses: 
    #print (j)

           first_name  gender              course_name
student_id
1               Faith  Female          Advanced Python
2                Mark    Male         Computer Science
3             Pauline  Female  Artificial Intelligence
4                 Ann  Female          Advanced Python
5                Jack    Male         Machine Learning

In [37]:
#join the Students collection to City and Country
#use aggregate function and lookup
join_student_city_country_courses=db.student.aggregate(
[
    {
        "$lookup":{
            "from":"city",
            "localField":"city_id",
            "foreignField":"city_id",
            "as": "student_city"
        }
    },
    {"$unwind":"$student_city"},
    {
        "$lookup":{
            "from":"country",
            "localField":"country_id",
            "foreignField":"country_id",
            "as": "student_country"
        }
    },
    {"$unwind":"$student_country"},
    {
        "$lookup":{
            "from":"courses",
            "localField":"course_id",
            "foreignField":"course_id",
            "as": "student_courses"
        }
    },
    {"$unwind":"$student_courses"},
    {
        "$project":{
            "_id":0,
            "student_id":1,
            "first_name":1,
            "last_name":1,
            "gender":1,
            "city":"$student_city.city_name",
            "Country_Name":"$student_country.country_Name",
            "Courses":"$student_courses.course_name"
        }
    }
])

#Data presentation in tabular form using pandas
student_city_country_courses_df=pd.DataFrame (list(join_student_city_country_courses))
#setting index
student_city_country_courses_df.set_index("student_id", inplace= True)
#Displaying the joined table
student_city_country_courses_df

           first_name  gender          city                  Courses
student_id
1               Faith  Female      New York          Advanced Python
2                Mark    Male       Nairobi         Computer Science
3             Pauline  Female  Johannesburg  Artificial Intelligence
4                 Ann  Female     Vancouver          Advanced Python
5                Jack    Male       Nairobi         Machine Learning